Tekla Open API Reference for Tekla Structures 2025
ViewCamera Properties
The ViewCamera type exposes the following members.
Properties
Name | Description
DirectionVector
The camera direction (controls the camera pan and tilt).
FieldOfView
The camera field of view as an angle (degrees) in the perspective view.
Location
The camera location in global coordinates (XYZ).
UpVector
The camera up vector (controls the camera roll).
View
The view where the camera belongs to.
ZoomFactor
The camera zoom factor (meter/pixel) in the orthogonal view.
Top
See Also
Reference
ViewCamera Class
Tekla.Structures.Model.UI Namespace